src/Catalogs/НастройкиРабочегоМестаКассира/НастройкиРабочегоМестаКассира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиРабочегоМестаКассира</name>
  <attributes>
    <name>АдресСервераЛояльности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполненияКассира</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполненияМестаРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВертикальнаяОриентацияПриложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтображения</name>
    <type>
      <types>EnumRef.ВидыОтображения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросПоРасчетуСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыдаватьНаличныеНаКассе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьВсеТоварыОтдельнойСтрокой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьСессиюКассираПослеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрыватьПодборПриВыбореТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьПодтверждениеВозраста18Плюс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноРедактированиеУсловийОграниченийПродаж</name>
    <comment>Название имеет смысл, т.к. значение по умолчанию должно быть ложным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьОбменИзИнтерфейсаРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОжиданияВыполненияПроверкиМаркиВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНовыйПодборТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОплатуБонусами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОплатуНаличными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОплатуСертификатами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПанельВводаНаличныхКупюр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРежимСкупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтрокуБыстрогоДобавленияТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЕМРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПроцентРучнойСкидки</name>
    <comment>Максимально возможный процент ручной скидки, одинаков для чека и отдельного товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПользователяПриЗапросеПрав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидатьРезультатПроверкиМарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьПриПроизвольномВидеОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьЧекВПользуПокупателяПострочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКассаККМ</name>
    <type>
      <types>DefinedType.КассаККМРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьПоследнийЧекНаЭкране</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьSMSКодПриЗаведенииКарты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьSMSКодПриПродаже</name>
    <type>
      <types>EnumRef.ВариантыОтправкиSMSПриПродаже</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьБумажныйЧек</name>
    <comment>На кассе при пробитии формируются: Ложь - электронные чеки, Истина - бумажные чеки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьАртикулНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКодНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервераЛояльности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажиСНесколькихКассККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>DefinedType.РабочееМестоРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВыборПродавца</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВыборСклада</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьСтрокиПриПечатиЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияТоварногоЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураПлиточногоИнтерфейсаПодбора</name>
    <type>
      <types>CatalogRef.ПалитраТоваровРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОператораПоПриемуПлатежей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>DefinedType.ПорядокОкругленияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонSMSПриЗаведенииКарты</name>
    <type>
      <types>DefinedType.ШаблонСообщенияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонSMSПриПродаже</name>
    <type>
      <types>DefinedType.ШаблонСообщенияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонSMSПриСписанииБонусов</name>
    <type>
      <types>DefinedType.ШаблонСообщенияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаВозврата</name>
    <type>
      <types>DefinedType.ХранилищеШаблоновРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаПродажи</name>
    <type>
      <types>DefinedType.ХранилищеШаблоновРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПромокоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураБыстрыхТоваров</name>
    <type>
      <types>CatalogRef.ПалитраТоваровРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПодборПлиточный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВертикальнаяОриентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЦенуВБыстрыхТоварах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКартинкуВБыстрыхТоварах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНумерациюСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПодтвержденияСписанияБонусов</name>
    <type>
      <types>DefinedType.Число15_2РМК</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийИспользования</name>
    <type>
      <types>EnumRef.СценарииИспользованияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдаватьПодарокНаКассе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаВРежимеМедленногоСоединения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтображенияСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводКомментарияКЧеку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьЗапускРезервногоКопированияИзФормыРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьБыстроеДобавлениеПакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураПакет</name>
    <type>
      <types>DefinedType.НоменклатураРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательНовогоЗаказа</name>
    <type>
      <types>DefinedType.КонтрагентРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПечатиЗаказаПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЗаказПриСоздании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВыборЯчейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводНаличныхАкселераторAlt</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводНаличныхАкселераторCtrl</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводНаличныхАкселераторShift</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГорячиеКлавиши</name>
    <attributes>
      <name>ИмяКнопки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокКнопки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Клавиша</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АкселераторAlt</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АкселераторCtrl</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АкселераторShift</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БыстрыеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВводНаличных</name>
    <attributes>
      <name>Номинал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Клавиша</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НастройкиРабочегоМестаКассира/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьНастройкиИзXML(ТекстXML, ЕстьОшибки, НастройкаРМКОбъект) Экспорт
	
	Попытка
		СтруктураНастроек = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстXML);
	Исключение
		
		ЕстьОшибки = Истина;
		ИмяСобытия = НСтр("ru = 'Загрузка настроек РМК из файла.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		Возврат;
		
	КонецПопытки;
	
	Для Каждого ЭлементНастройки Из СтруктураНастроек Цикл
		
		Попытка
			
			Если Лев(ЭлементНастройки.Ключ, 9) = "Константа" Тогда
				
				ИмяКонстанты = Сред(ЭлементНастройки.Ключ, 11);
				Константы[ИмяКонстанты].Установить(ЭлементНастройки.Значение);
				
			ИначеЕсли ЭлементНастройки.Ключ = "НастройкаРМК_ГорячиеКлавиши" Тогда
				НастройкаРМКОбъект.ГорячиеКлавиши.Загрузить(ЭлементНастройки.Значение);
			ИначеЕсли ЭлементНастройки.Ключ = "НастройкаРМК_БыстрыеТовары" Тогда
				
				ТаблицаБыстрыеТовары = ЭлементНастройки.Значение;
				НастройкаРМКОбъект.БыстрыеТовары.Очистить();
				
				Для Каждого СтрокаБыстрыеТовары Из ТаблицаБыстрыеТовары Цикл
					
					Если НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаБыстрыеТовары.Номенклатура)
						Или (НЕ СтрокаБыстрыеТовары.Характеристика.Пустая()
							И НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаБыстрыеТовары.Характеристика)) Тогда
							Продолжить;
					КонецЕсли;
						
					НоваяСтрока = НастройкаРМКОбъект.БыстрыеТовары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаБыстрыеТовары);
					
				КонецЦикла;
				
			ИначеЕсли ЭлементНастройки.Ключ = "НастройкаРМК_ВводНаличных" Тогда
				ЗагрузитьТаблицуВводаНаличных(НастройкаРМКОбъект, ЭлементНастройки.Значение);
			ИначеЕсли Лев(ЭлементНастройки.Ключ, 12) = "НастройкаРМК" Тогда
				
				ИмяРеквизита = Сред(ЭлементНастройки.Ключ, 14);
				НастройкаРМКОбъект[ИмяРеквизита] = ЭлементНастройки.Значение;
				
			ИначеЕсли ЭлементНастройки.Ключ = "ШаблоныЧеков" Тогда
				
				Для Каждого СтрокаШаблонаЧека Из ЭлементНастройки.Значение Цикл
					
					СсылкаШаблона = СтрокаШаблонаЧека.Ссылка;
					
					Если НЕ СсылкаШаблона.Пустая() И НЕ ОбщегоНазначения.СсылкаСуществует(СсылкаШаблона) Тогда
						
						СтрокаGUID = СсылкаШаблона.УникальныйИдентификатор();
						НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
						НоваяСсылка = Справочники.ХранилищеШаблонов.ПолучитьСсылку(НовыйGUID);
						ОбъектШаблонЧека = Справочники.ХранилищеШаблонов.СоздатьЭлемент();
						ОбъектШаблонЧека.УстановитьСсылкуНового(НоваяСсылка);
						ЗаполнитьЗначенияСвойств(ОбъектШаблонЧека, СтрокаШаблонаЧека, , "Ссылка");
						ОбъектШаблонЧека.Записать();
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ЭлементНастройки.Ключ ="ПалитраБыстрыхТоваров" Тогда
				
				Для Каждого СтрокаПалитры Из ЭлементНастройки.Значение Цикл
					
					СсылкаПалитраТоваров = СтрокаПалитры.Ссылка;
					
					Если НЕ СсылкаПалитраТоваров.Пустая() Тогда
							
						Если НЕ ОбщегоНазначения.СсылкаСуществует(СсылкаПалитраТоваров) Тогда
						
							СтрокаGUID = СсылкаПалитраТоваров.УникальныйИдентификатор();
							НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
							НоваяСсылка = Справочники.ПалитраТоваровРМК.ПолучитьСсылку(НовыйGUID);
							ОбъектПалитраТоваров = Справочники.ПалитраТоваровРМК.СоздатьЭлемент();
							ОбъектПалитраТоваров.УстановитьСсылкуНового(НоваяСсылка);
							
						Иначе
							ОбъектПалитраТоваров = СсылкаПалитраТоваров.ПолучитьОбъект();
						КонецЕсли;
						
						Попытка
							ОбъектПалитраТоваров.Заблокировать();
						Исключение
							ТекстОшибки = НСтр("ru = 'Ошибка блокировки палитры товаров, при загрузке из файла настроек.'", ОбщегоНазначения.КодОсновногоЯзыка());
							ЗаписьЖурналаРегистрации(ТекстОшибки,
								УровеньЖурналаРегистрации.Ошибка, ,
								ОбъектПалитраТоваров,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							Продолжить;
						КонецПопытки;
		
						ЗаполнитьЗначенияСвойств(ОбъектПалитраТоваров, СтрокаПалитры, , "Ссылка, Состав");
						
						ОбъектПалитраТоваров.Состав.Очистить();
						Для Каждого СтрокаСостава Из СтрокаПалитры.Состав Цикл
							
							Если (НЕ СтрокаСостава.Номенклатура.Пустая() И НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаСостава.Номенклатура))
								Или (НЕ СтрокаСостава.Характеристика.Пустая() И НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаСостава.Характеристика)) Тогда
								Продолжить;
							КонецЕсли;
							
							НоваяСтрока = ОбъектПалитраТоваров.Состав.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСостава);
						КонецЦикла;
						
						ОбъектПалитраТоваров.Записать();
						
					КонецЕсли;
				
				КонецЦикла;
				
			ИначеЕсли ЭлементНастройки.Ключ = "ФайлыПалитрыБыстрыхТоваров" Тогда
				
				Для Каждого СтрокаФайла Из ЭлементНастройки.Значение Цикл
					
					СсылкаФайла = СтрокаФайла.Ссылка;
					
					Если НЕ СсылкаФайла.Пустая() Тогда
						
						Если НЕ ОбщегоНазначения.СсылкаСуществует(СсылкаФайла) Тогда
						
							СтрокаGUID = СсылкаФайла.УникальныйИдентификатор();
							НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
							НоваяСсылка = Справочники.ПалитраТоваровРМКПрисоединенныеФайлы.ПолучитьСсылку(НовыйGUID);
							ОбъектФайл = Справочники.ПалитраТоваровРМКПрисоединенныеФайлы.СоздатьЭлемент();
							ОбъектФайл.УстановитьСсылкуНового(НоваяСсылка);
							
							ЗаполнитьЗначенияСвойств(ОбъектФайл, СтрокаФайла, , "Ссылка");
							ОбъектФайл.Записать();
							
						Иначе
							ОбъектФайл = СсылкаФайла.ПолучитьОбъект();
						КонецЕсли;
					
						Если ЗначениеЗаполнено(СтрокаФайла.ДвоичныеДанные) Тогда
							АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(СтрокаФайла.ДвоичныеДанные);
							
							ИнформацияОФайле = Новый Структура;
							ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", АдресВременногоХранилищаФайла);
							ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
							ИнформацияОФайле.Вставить("ИмяБезРасширения"              , СтрокаФайла.Наименование);
							ИнформацияОФайле.Вставить("ДатаМодификацииУниверсальная"  , СтрокаФайла.ДатаМодификацииУниверсальная);
							ИнформацияОФайле.Вставить("Расширение"                    , СтрЗаменить(СтрокаФайла.Расширение,".",""));
							ИнформацияОФайле.Вставить("Редактирует"                   , Неопределено);
							
							РаботаСФайлами.ОбновитьФайл(ОбъектФайл.Ссылка, ИнформацияОФайле);
							
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Исключение
			
			ЕстьОшибки = Истина;
			ИмяСобытия = НСтр("ru = 'Сохранение настроек РМК при загрузке из файла настроек.'",
				ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				
		КонецПопытки;
			
	КонецЦикла;
	
	Попытка
		НастройкаРМКОбъект.Записать();
	Исключение
		
		ЕстьОшибки = Истина;
		ИмяСобытия = НСтр("ru = 'Запись справочника НастройкиРМК при загрузке из файла настроек.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		МетаданныеОбъекта = Метаданные.Справочники.НастройкиРабочегоМестаКассира;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта,
			НастройкаРМКОбъект.Ссылка, ТекстОшибки);
			
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьТаблицуВводаНаличных(НастройкаРМКОбъект, ТаблицаНоминаловКупюр)
	
	НастройкаРМКОбъект.ВводНаличных.Очистить();
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	МассивНоминаловКупюр = ОбщегоНазначенияРМККлиентСервер.НоминалыКупюр();
	ИндексСтроки = 0;
	ТекущаяСтрокаНоминала = Неопределено;
	КоличествоСтрокТаблицы = ТаблицаНоминаловКупюр.Количество();
	Для Каждого ЭлементНоминала Из МассивНоминаловКупюр Цикл
		
		НоминалЧислом = ОписаниеТипаЧисло.ПривестиЗначение(ЭлементНоминала);
		Если НоминалЧислом > 0 Тогда
			
			ТекущийНоминалТаблицы = 0;
			Пока ТекущийНоминалТаблицы < НоминалЧислом И ИндексСтроки < КоличествоСтрокТаблицы Цикл
				ТекущаяСтрокаНоминала = ТаблицаНоминаловКупюр[ИндексСтроки];
				ТекущийНоминалТаблицы = ОписаниеТипаЧисло.ПривестиЗначение(ТекущаяСтрокаНоминала.Номинал);
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
			КлавишаКупюры = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
			ИспользованиеНоминала = Истина;
			Если ТекущийНоминалТаблицы = НоминалЧислом Тогда
				ИспользованиеНоминала = ТекущаяСтрокаНоминала.Использование;
				Если Не ТаблицаНоминаловКупюр.Колонки.Найти("Клавиша") = Неопределено Тогда
					КлавишаКупюры = ТекущаяСтрокаНоминала.Клавиша;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока = НастройкаРМКОбъект.ВводНаличных.Добавить();
			НоваяСтрока.Номинал = ЭлементНоминала;
			НоваяСтрока.Использование = ИспользованиеНоминала;
			НоваяСтрока.Клавиша = КлавишаКупюры;
		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
